class Human:
    голод = 100
    сила = 100
    макс_вік = 100
    звати = 'Дейв'

class Cyborg(Human):
    сила = 200
    звати = 'Кіборг-Дейв'
    Вміння = 'Діамантове Око (підвищена точність)'
    Зброя = 'Пістолет SIG Sauer P226'

class Stormtrooper(Cyborg):
    звати = 'Штурмовик-Дейв'
    Вміння2 = 'Контроль+ (підвищений контроль віддачі)'
    Зброя2 = 'Автомат A-545'
    Броня = 'Екзоскелет Мул'
    def __init__(self):
        print(f"звати = {self.звати}")
        print(f"голод = {self.голод}")
        print(f"сила = {self.сила}")
        print(f"макс_вік = {self.макс_вік}")
        print(f"Вміння = {self.Вміння}")
        print(f"Вміння 2 = {self.Вміння2}")
        print(f"Зброя = {self.Зброя}")
        print(f"Зброя 2 = {self.Зброя2}")
        print(f"Броня = {self.Броня}")

print('-'*5,'Дейв','-'*5)
Дейв = Stormtrooper()

